//  Task 1. На HTML-сторінці є посилання <a>. У випадку коли, href починається на https://, потрібно додати посиланню атрибут target="_blank".
$('a[href*="https://"]').attr('target', '_blank');


// Task 2. Для заданої сторінки знайдіть всі <h2> з класом head, зробіть для них зелений колір фону, потім серед знайдених елементів знайдіть елементи з класом inner і поставте їм розмір шрифту 35px.
let $el = $('h2.head');
$el.css('background', 'green');
$el.find('.inner').css('fontSize','35px');



// Task 3. Знайдіть теги <div>, які стоять безпосередньо після <h3> і перемістіть кожен <div>-елемент так, щоб він став безпосередньо над <h3>.
$('h3:first').prepend($('h3:first').next());
$('h3:last').prepend($('h3:last').next());


// Task 4. На HTML-сторінці є 6 чекбоксів. Напишіть скріпт, який після того, як користувач позначив будь-які 3 чекбокси, всі чекбокси робить неактивними.
$('input').on('click', function checkInputs() {
   if ($("input:checked").length >= 3) {
       $('input').prop('disabled', true);
   }
})